In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

## Task1

### persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.

In [4]:
df = pd.read_csv("../Dataset/persona.csv")
df

      PRICE   SOURCE     SEX COUNTRY  AGE
0        39  android    male     bra   17
1        39  android    male     bra   17
2        49  android    male     bra   17
3        29  android    male     tur   17
4        49  android    male     tur   17
...     ...      ...     ...     ...  ...
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31

[5000 rows x 5 columns]

In [5]:
def check_df(dataframe, head=5):
    print("###Shape###")
    print(dataframe.shape)
    print("###Types###")
    print(dataframe.dtypes)
    print("###Head###")
    print(dataframe.head(head))
    print("###Tail###")
    print(dataframe.tail(head))
    print("###NA###")
    print(dataframe.isnull().sum())
    print("###Quantiles###")
    print(dataframe.describe([0,0.05,0.50,0.95,0.99,1]).T)

check_df(df)

###Shape###
(5000, 5)
###Types###
PRICE       int64
SOURCE     object
SEX        object
COUNTRY    object
AGE         int64
dtype: object
###Head###
   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17
###Tail###
      PRICE   SOURCE     SEX COUNTRY  AGE
4995     29  android  female     bra   31
4996     29  android  female     bra   31
4997     29  android  female     bra   31
4998     39  android  female     bra   31
4999     29  android  female     bra   31
###NA###
PRICE      0
SOURCE     0
SEX        0
COUNTRY    0
AGE        0
dtype: int64
###Quantiles###
        count     mean        std   min    0%    5%   50%   95%   99%  100%  \
PRICE  5000.0  34.1320  12.464897   9.0   9.0  19.0  39.0  49.0  59.0  59.0
AGE    5000.0  23.5814   8.995908  15.0  15.0  15.0  21.0  43.0  53.0  66.0

        max
PRICE  59.0
AGE    66.0

### Kaç unique SOURCE vardır? Frekansları nedir?

In [25]:
df["SOURCE"].describe()

count        5000
unique          2
top       android
freq         2974
Name: SOURCE, dtype: object

### Kaç unique PRICE vardır?

In [21]:
df["PRICE"].nunique()

6

### Hangi PRICE'dan kaçar tane satış gerçekleşmiş?

In [29]:
df["PRICE"].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

### Hangi ülkeden kaçar tane satış olmuş?

In [31]:
df["COUNTRY"].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

### Ülkelere göre satışlardan toplam ne kadar kazanılmış?

In [38]:
df.groupby("COUNTRY").agg({"PRICE": "sum"}).reset_index()

  COUNTRY  PRICE
0     bra  51354
1     can   7730
2     deu  15485
3     fra  10177
4     tur  15689
5     usa  70225

### SOURCE türlerine göre satış sayıları nedir?

In [41]:
df.groupby("SOURCE").count()

         PRICE   SEX  COUNTRY   AGE
SOURCE
android   2974  2974     2974  2974
ios       2026  2026     2026  2026

### Ülkelere göre PRICE ortalamaları nedir?

In [48]:
df.groupby("COUNTRY").agg({"PRICE": ["mean"]})

             PRICE
              mean
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

### SOURCE'lara göre PRICE ortalamaları nedir?

In [49]:
df.groupby("SOURCE").agg({"PRICE": ["mean"]})

             PRICE
              mean
SOURCE
android  34.174849
ios      34.069102

### COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [62]:
#df.groupby(["COUNTRY","SOURCE"])["PRICE"].mean()
df.groupby(["COUNTRY","SOURCE"]).agg({"PRICE": ["mean"]})

                     PRICE
                      mean
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

## Task 2: COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [100]:
df.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE": "mean"})

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897
...                               ...
usa     ios     male   42   30.250000
                       50   39.000000
                       53   34.000000
                       55   29.000000
                       59   46.500000

[348 rows x 1 columns]

## Task 3: Çıktıyı PRICE’a göre sıralayınız.

In [141]:
agg_df = df.groupby(["COUNTRY","SOURCE","SEX","AGE"]).agg({"PRICE": "mean"}).sort_values("PRICE",ascending=False)

In [142]:
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

## Task 4: Indekste yer alan isimleri değişken ismine çeviriniz.

In [143]:
agg_df.reset_index(inplace=True)

In [144]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

## Task 5: Age değişkenini kategorik değişkene çeviriniz ve agg_df’e ekleyiniz.

In [145]:
bin = [0,18,23,30,40,df["AGE"].max()]
categories = ['0_18', '19_23', '24_30', '31_40', '41_' + str(agg_df["AGE"].max())]
agg_df["AGE_CAT"] = pd.cut(agg_df["AGE"], bins=bin, labels=categories)

In [146]:
agg_df.head(10)

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46   59.0   41_66
1     usa  android    male   36   59.0   31_40
2     fra  android  female   24   59.0   24_30
3     usa      ios    male   32   54.0   31_40
4     deu  android  female   36   49.0   31_40
5     deu  android  female   51   49.0   41_66
6     deu      ios    male   20   49.0   19_23
7     usa  android  female   47   49.0   41_66
8     fra      ios    male   20   49.0   19_23
9     usa      ios    male   59   46.5   41_66

## Task 6: Yeni seviye tabanlı müşterileri (persona) tanımlayınız.

In [147]:
agg_df["customers_level_based"] = agg_df[["COUNTRY","SOURCE","SEX","AGE_CAT"]].agg(lambda x: '_'.join(x).upper(),axis=1)
agg_df

    COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT     customers_level_based
0       bra  android    male   46   59.0   41_66    BRA_ANDROID_MALE_41_66
1       usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_31_40
2       fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_30
3       usa      ios    male   32   54.0   31_40        USA_IOS_MALE_31_40
4       deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_31_40
..      ...      ...     ...  ...    ...     ...                       ...
343     usa      ios  female   38   19.0   31_40      USA_IOS_FEMALE_31_40
344     usa      ios  female   30   19.0   24_30      USA_IOS_FEMALE_24_30
345     can  android  female   27   19.0   24_30  CAN_ANDROID_FEMALE_24_30
346     fra  android    male   18   19.0    0_18     FRA_ANDROID_MALE_0_18
347     deu  android    male   26    9.0   24_30    DEU_ANDROID_MALE_24_30

[348 rows x 7 columns]

In [150]:
agg_df.groupby("customers_level_based").agg({"PRICE":"mean"})

                              PRICE
customers_level_based
BRA_ANDROID_FEMALE_0_18   35.645303
BRA_ANDROID_FEMALE_19_23  34.077340
BRA_ANDROID_FEMALE_24_30  33.863946
BRA_ANDROID_FEMALE_31_40  34.898326
BRA_ANDROID_FEMALE_41_66  36.737179
...                             ...
USA_IOS_MALE_0_18         33.983495
USA_IOS_MALE_19_23        34.901872
USA_IOS_MALE_24_30        34.838143
USA_IOS_MALE_31_40        36.206324
USA_IOS_MALE_41_66        35.750000

[109 rows x 1 columns]

In [153]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT     customers_level_based
0     bra  android    male   46   59.0   41_66    BRA_ANDROID_MALE_41_66
1     usa  android    male   36   59.0   31_40    USA_ANDROID_MALE_31_40
2     fra  android  female   24   59.0   24_30  FRA_ANDROID_FEMALE_24_30
3     usa      ios    male   32   54.0   31_40        USA_IOS_MALE_31_40
4     deu  android  female   36   49.0   31_40  DEU_ANDROID_FEMALE_31_40

## Task 7: Yeni müşterileri (personaları) segmentlere ayırınız.

In [158]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"], 4, labels=["D", "C", "B", "A"])
agg_df.head()

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,customers_level_based,SEGMENT
0,bra,android,male,46,59.0,41_66,BRA_ANDROID_MALE_41_66,A
1,usa,android,male,36,59.0,31_40,USA_ANDROID_MALE_31_40,A
2,fra,android,female,24,59.0,24_30,FRA_ANDROID_FEMALE_24_30,A
3,usa,ios,male,32,54.0,31_40,USA_IOS_MALE_31_40,A
4,deu,android,female,36,49.0,31_40,DEU_ANDROID_FEMALE_31_40,A

In [159]:
agg_df.groupby("SEGMENT").agg({"PRICE": ["mean","max","sum"]})

             PRICE
              mean        max          sum
SEGMENT
D        27.302596  31.105263  2375.325850
C        32.933339  34.000000  3128.667165
B        35.436170  37.000000  2870.329792
A        41.434736  59.000000  3521.952577

## Task 8: Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini tahmin ediniz.

In [160]:
new_user = "TUR_ANDROID_FEMALE_31_40"
agg_df[agg_df["customers_level_based"] == new_user]

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,customers_level_based,SEGMENT
18,tur,android,female,32,43.000000,31_40,TUR_ANDROID_FEMALE_31_40,A
35,tur,android,female,31,40.666667,31_40,TUR_ANDROID_FEMALE_31_40,A

In [167]:
new_user2 = "FRA_IOS_FEMALE_31_40"
agg_df[agg_df["customers_level_based"] == new_user2]

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,customers_level_based,SEGMENT
208,fra,ios,female,40,33.000000,31_40,FRA_IOS_FEMALE_31_40,C
221,fra,ios,female,31,32.636364,31_40,FRA_IOS_FEMALE_31_40,C